In [1]:
import pandas as pd

In [4]:
df = pd.DataFrame(
    {
        "a": [4,5,6],
        "b": [7,8,9],
        "c": [10,11,12]
    },
    index=[1,2,3]
)

df = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12]],
index=[1, 2, 3],
columns=['a', 'b', 'c'])

In [8]:
df = pd.DataFrame( {
    "Name": ["Alice", "Bob", "Aritra"],
    "Age": [25,30,35],
    "Location": ["Seattle", "New York", "Kona"]
    
},
    index=[1,2,3]
)

In [6]:
df

       Name  Age  Location
100   Alice   25   Seattle
200     Bob   30  New York
300  Aritra   35      Kona

In [10]:
df.head()

     Name  Age  Location
1   Alice   25   Seattle
2     Bob   30  New York
3  Aritra   35      Kona

In [11]:
df.tail()

     Name  Age  Location
1   Alice   25   Seattle
2     Bob   30  New York
3  Aritra   35      Kona

In [13]:
df.shape

(3, 3)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 1 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      3 non-null      object
 1   Age       3 non-null      int64
 2   Location  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 96.0+ bytes

In [15]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [17]:
df['Age'].max()

35

In [18]:
df['Age'].min()

25

In [19]:
df['Age'].mean()

np.float64(30.0)

In [20]:
df.drop_duplicates()

     Name  Age  Location
1   Alice   25   Seattle
2     Bob   30  New York
3  Aritra   35      Kona

In [22]:
df = pd.DataFrame( {
    "Name": ["Alice", "Bob", "Aritra", "Alice"],
    "Age": [25,30,35,25],
    "Location": ["Seattle", "New York", "Kona", "Seattle"]
    
},
    index=[1,2,3,4]
)

In [24]:
df

     Name  Age  Location
1   Alice   25   Seattle
2     Bob   30  New York
3  Aritra   35      Kona
4   Alice   25   Seattle

In [25]:
df.drop_duplicates()

     Name  Age  Location
1   Alice   25   Seattle
2     Bob   30  New York
3  Aritra   35      Kona

In [26]:
df.loc[1]

Name          Alice
Age              25
Location    Seattle
Name: 1, dtype: object

In [28]:
df.iloc[0:]

     Name  Age  Location
1   Alice   25   Seattle
2     Bob   30  New York
3  Aritra   35      Kona
4   Alice   25   Seattle

In [29]:
df.drop(4)

     Name  Age  Location
1   Alice   25   Seattle
2     Bob   30  New York
3  Aritra   35      Kona

In [38]:
df[df.Age < 30]

    Name  Age Location
1  Alice   25  Seattle
4  Alice   25  Seattle

In [35]:
df.isnull()

    Name    Age  Location
1  False  False     False
2  False  False     False
3  False  False     False
4  False  False     False